<a href="https://colab.research.google.com/github/speculate123/Project202103ML/blob/master/Test.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [54]:
# from google.colab import drive
# drive.mount('/content/drive')
# %cd /content/drive/MyDrive/

Mounted at /content/drive

In [55]:
!rm -r ./Project202103ML/
!git clone https://github.com/speculate123/Project202103ML.git
%cd ./Project202103ML

/content/drive/MyDrive
Cloning into 'Project202103ML'...
remote: Enumerating objects: 59, done.
remote: Counting objects: 100% (59/59), done.
remote: Compressing objects: 100% (50/50), done.
remote: Total 59 (delta 24), reused 21 (delta 3), pack-reused 0
Unpacking objects: 100% (59/59), done.

In [63]:
import DB
import pandas as pd
data = pd.read_csv("data/HistoricalData_1617305671760.csv")
data

            Date Close/Last     Volume      Open       High        Low
0     03/31/2021    $122.15  118323800   $121.65    $123.52    $121.15
1     03/30/2021     $119.9   85671920   $120.11  $120.4031    $118.86
2     03/29/2021    $121.39   80819200   $121.65    $122.58  $120.7299
3     03/26/2021    $121.21   94071230   $120.35    $121.48    $118.92
4     03/25/2021    $120.59   98844680   $119.54    $121.66       $119
...          ...        ...        ...       ...        ...        ...
2511  04/07/2011   $12.0743  373073251   $12.075   $12.1582   $12.0011
2512  04/06/2011   $12.0729  401842959  $12.1864   $12.2821   $12.0407
2513  04/05/2011   $12.1032  482607247  $12.0354   $12.2232        $12
2514  04/04/2011   $12.1854  459004936  $12.2968   $12.3071   $12.0857
2515  04/01/2011   $12.3057  417983833  $12.5396   $12.5567   $12.2607

[2516 rows x 6 columns]

In [64]:
data['Date'] = pd.to_datetime(data['Date'])
data = data.rename(columns={"Close/Last": "Close"})
data['Close'] = data['Close'].map(lambda x: x.lstrip('$'))
data['Open'] = data['Open'].map(lambda x: x.lstrip('$'))
data['High'] = data['High'].map(lambda x: x.lstrip('$'))
data['Low'] = data['Low'].map(lambda x: x.lstrip('$'))
data

           Date    Close     Volume     Open      High       Low
0    2021-03-31   122.15  118323800   121.65    123.52    121.15
1    2021-03-30    119.9   85671920   120.11  120.4031    118.86
2    2021-03-29   121.39   80819200   121.65    122.58  120.7299
3    2021-03-26   121.21   94071230   120.35    121.48    118.92
4    2021-03-25   120.59   98844680   119.54    121.66       119
...         ...      ...        ...      ...       ...       ...
2511 2011-04-07  12.0743  373073251   12.075   12.1582   12.0011
2512 2011-04-06  12.0729  401842959  12.1864   12.2821   12.0407
2513 2011-04-05  12.1032  482607247  12.0354   12.2232        12
2514 2011-04-04  12.1854  459004936  12.2968   12.3071   12.0857
2515 2011-04-01  12.3057  417983833  12.5396   12.5567   12.2607

[2516 rows x 6 columns]

In [79]:
data.to_csv('data.csv', index=False)

In [75]:
cursor.execute("""DROP TABLE aapl""")
connection.commit()

In [82]:
cursor.execute("""CREATE TABLE AAPL(
date DATE,
close DECIMAL(8,4),
volume INT,
open DECIMAL(8,4),
high DECIMAL(8,4),
low DECIMAL(8,4))""")
connection.commit()

In [83]:
sql = """
SELECT "table_name","column_name", "data_type", "table_schema"
FROM INFORMATION_SCHEMA.COLUMNS
WHERE "table_schema" = 'public'
ORDER BY table_name  
"""
pd.read_sql(sql, con=connection)

  table_name column_name data_type table_schema
0       aapl        high   numeric       public
1       aapl       close   numeric       public
2       aapl        open   numeric       public
3       aapl        date      date       public
4       aapl      volume   integer       public
5       aapl         low   numeric       public

In [84]:
with open('data.csv', 'r') as row:
    next(row)# Skip the header row.
    cursor.copy_from(row, 'AAPL', sep=',')
connection.commit()

In [85]:
sql = """
SELECT * FROM aapl 
ORDER BY date asc
"""
df = pd.read_sql(sql, con=connection)
df

            date     close     volume      open      high       low
0     2011-04-01   12.3057  417983833   12.5396   12.5567   12.2607
1     2011-04-04   12.1854  459004936   12.2968   12.3071   12.0857
2     2011-04-05   12.1032  482607247   12.0354   12.2232   12.0000
3     2011-04-06   12.0729  401842959   12.1864   12.2821   12.0407
4     2011-04-07   12.0743  373073251   12.0750   12.1582   12.0011
...          ...       ...        ...       ...       ...       ...
2511  2021-03-25  120.5900   98844680  119.5400  121.6600  119.0000
2512  2021-03-26  121.2100   94071230  120.3500  121.4800  118.9200
2513  2021-03-29  121.3900   80819200  121.6500  122.5800  120.7299
2514  2021-03-30  119.9000   85671920  120.1100  120.4031  118.8600
2515  2021-03-31  122.1500  118323800  121.6500  123.5200  121.1500

[2516 rows x 6 columns]